>>source format free
identification division.
program-id. april2.
environment division.
data division.
working-storage section.
77 low-nums pic 9(2) value low-values.
77 low-nums2 pic s9(3) value low-value.
77 high-nums pic 9(2) value high-values.
77 high-nums2 pic s9(2) value high-value.
procedure division.
display low-nums.
display low-nums2.
display high-nums.
display high-nums2.
stop run.


