       ID DIVISION.
       PROGRAM-ID. cobol85math.
       AUTHOR. CHRIS.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
         WORKING-STORAGE SECTION.
         01 VAL1 PIC S9(3) VALUE -100.
         01 VAL2 PIC 9(3) VALUE ZEROES.
         01 VAL3 PIC S999V999 VALUE -0.50.
         01 VAL4 PIC S999V999 VALUE ZEROS.
         01 VAL5 PIC S999V999 VALUE 75.75.
         01 VAL6 PIC S999V999 VALUE ZEROES.
         01 VAL7 PIC 9(9) VALUE 7.
         01 VAL8 PIC 9(9) VALUE ZEROS.
         01 VAL9 PIC S999V999 VALUE 777.
         01 VAL10 PIC S999V999 VALUE ZEROES.
       PROCEDURE DIVISION.
       COMPUTE VAL2 = FUNCTION ABS(VAL1).
       DISPLAY VAL2.
       COMPUTE VAL4 = FUNCTION ACOS(VAL3).
       DISPLAY VAL4.
       COMPUTE VAL4 = (4 - 2) + 3.
       DISPLAY VAL4.
       COMPUTE VAL6 = FUNCTION COS(VAL5).
       DISPLAY VAL6.
       COMPUTE VAL8 = FUNCTION FACTORIAL(VAL7).
       DISPLAY VAL8.
       COMPUTE VAL10 = FUNCTION PI * FUNCTION LOG(VAL9).
       DISPLAY VAL10.

       STOP RUN.
