      *--------------------------------- 
      * This is the conventional way to 
      * make a flowerbed in Cobol. 
      *----------------------------------

       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
       STOP RUN.
