        IDENTIFICATION DIVISION.
        PROGRAM-ID. MARCH2.
        ENVIRONMENT DIVISION.
        DATA DIVISION.
          WORKING-STORAGE SECTION.
          01 VAL1 PIC 9(2) VALUE ZEROS.
          01 VAL2 REDEFINES VAL1 PIC 9(2).
        PROCEDURE DIVISION.
        DISPLAY VAL1.
        DISPLAY VAL2.
        MOVE 2 TO VAL1.
        DISPLAY VAL1.
        DISPLAY VAL2.
        MOVE 3 TO VAL2.
        DISPLAY VAL1.
        DISPLAY VAL2.
        STOP RUN.

