IDENTIFICATION DIVISION.
PROGRAM-ID. PARAGRAPHNAMES.
ENVIRONMENT DIVISION.
DATA DIVISION.

WORKING-STORAGE SECTION.
FIRST-NUMBER    PIC 99.
SECOND-NUMBER   PIC 99.
THIRD-NUMBER    PIC 999.

PROCEDURE DIVISION.

PROGRAM-BEGIN.

    DISPLAY "THIS PROGRAM WILL ADD 2 NUMBERS.".

GET-FIRST-NUMBER.

    DISPLAY "ENTER THE FIRST NUMBER.".
    ACCEPT FIRST-NUMBER.

GET-SECOND-NUMBER.

    DISPLAY "ENTER THE SECOND NUMBER".
    ACCEPT SECOND-NUMBER.

COMPUTE-AND-DISPLAY.
    COMPUTE THE-RESULT = FIRST-NUMBER + SECOND-NUMBER.

    DISPLAY "THE RESULT IS " THE-RESULT.

PROGRAM-DONE.
STOP RUN.
