IDENTIFICATION DIVISION.
PROGRAM-ID. SAY-HELLO.
ENVIRONMENT DIVISION.
DATA DIVISION.

WORKING-STORAGE SECTION.

01 THE-NAME PICTURE IS XXXXXXXXXX.

PROCEDURE DIVISION.

PROGRAM-BEGIN.

DISPLAY "ENTER SOMEONE'S NAME.".

ACCEPT THE-NAME.

DISPLAY "HELLO " THE-NAME.

PROGRAM-DONE.
STOP RUN.

