IDENTIFICATION DIVISION.
PROGRAM-ID. SHELLUSE.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.

PROCEDURE DIVISION.
PROGRAM-BEGIN.

PROGRAM-DONE.
STOP RUN.

