IDENTIFICATION DIVISION.
PROGRAM-ID. useperform.

* this program illustrates the use of perform, running a subroutine.

ENVIRONMENT DIVISION.
DATA DIVISION.
PROCEDURE DIVISION.

PROGRAM-BEGIN.
    DISPLAY "TODAY'S MESSAGE IS: ".
    PERFORM SAY-HELLO.

PROGRAM-DONE.
STOP RUN.

* THIS IS CALLED A PARAGRAPH.
SAY-HELLO.
    DISPLAY "HELLO WORLD".

