      ******************************************************************
      * Author: C.R.
      * Date: 2022 Oct 1
      * Purpose: Testing this IDE
      * Tectonics: cobc
      * 
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.

       PROCEDURE DIVISION.
       DISPLAY 'Hello World'.
       STOP RUN.
