* this program didn't compile.
IDENTIFICATION DIVISION.
PROGRAM-ID. ADD01.
ENVIRONMENT DIVISION.
DATA DIVISION.

WORKING-STORAGE SECTION.
FIRST-NUMBER PICTURE IS 99
SECOND-NUMBER PICTURE IS 99.
THE-RESULT- PICTURE IS 999.

PROCEDURE DIVISION.

DISPLAY 'ENTER NUMBER'.
ACCEPT FIRST-NUMBER.
DISPLAY 'SECOND NUMBER'.
ACCEPT SECOND-NUMBER.

COMPUTE THE-RESULT = FIRST-NUMBER + SECOND-NUMBER.
DISPLAY THE-RESULT.
STOP RUN.
