IDENTIFICATION DIVISION.
PROGRAM-ID. COMMENT.
ENVIRONMENT DIVISION.
DATA DIVISION.
PROCEDURE DIVISION.
* this is supposed to be a comment. 
PROGRAM-BEGIN.
DISPLAY "THIS PROGRAM HAS FOUR DIVISIONS". 
PROGRAM-DONE.
STOP RUN.
