IDENTIFICATION DIVISION.
PROGRAM-ID. CONST.
ENVIRONMENT DIVISION.
DATA DIVISION.
PROCEDURE DIVISION.
DISPLAY 'Hello, world'.
DISPLAY 55.
DISPLAY 12.607.

STOP RUN.
