IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
PROCEDURE DIVISION.
DISPLAY 'Hello, world'.
perform say-hello.
STOP RUN.

say-hello.
    display "hello again".
